Revit 2024 API
Macro.MacroModule Property
 The Macro module.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public MacroModule MacroModule { get; }
Visual Basic
Public ReadOnly Property MacroModule As MacroModule
	Get
Visual C++
public:
property MacroModule^ MacroModule {
	MacroModule^ get ();
}
See Also
Macro Class
Autodesk.Revit.DB.Macros Namespace